# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Binaries
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'moreutils'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'mas'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash'
brew 'zlib' # Needed for Memcached
brew 'zsh'
brew 'zsh-completions'

# Install Bash 4.
# Note: don’t forget to add `/usr/local/bin/bash` to `/etc/shells` before
# running `chsh`.
brew 'bash'

# Development
brew 'php'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'

# Apps

cask 'docker'
cask 'keepingyouawake'
cask 'firefox'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'now'
cask 'figma'
cask 'flinto'
cask 'tower'
cask 'sketch'
cask 'alacritty'
cask 'spectacle'
cask 'appcleaner'
cask 'spectrum'
cask 'typora'
cask 'visual-studio-code-insiders'
cask 'paintcode'
cask 'phpstorm'
cask 'sequel-pro'
cask 'tableplus'
cask 'hyper'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'Sauce Code Nerd Font'

# Mac App Store
mas 'Sip', id: 507257563
mas 'Affinity Designer', id: 824171161
mas 'Affinity Photo', id: 824183456
mas 'iA Writer', id: 775737590
mas 'Contrast Color Accessibility', id: 1254981365
mas 'Keynote', id: 409183694
mas 'Page', id: 409201541
mas 'Numbers', id: 409203825
mas 'CotEditor', id: 1024640650
mas 'Unsplash', id: 1284863847


