# Taps

tap 'cask-fonts'
tap 'cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'moreutils'
brew 'git'
brew 'grep'
brew 'mas'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash'
brew 'zlib' # Needed for Memcached
brew 'zsh-completions'
brew 'composer'
brew 'z'

# Development
brew 'php'
brew 'mysql'
brew 'nginx'
brew 'nvm'
brew 'sqlite'
brew 'redis'
brew 'ruby'

# Apps

cask 'docker'
cask 'firefox'
cask 'firefox-nightly'
cask 'now'
cask 'figma'
cask 'flinto'
cask 'spectacle'
cask 'appcleaner'
cask 'spectrum'
cask 'paintcode'
cask 'sequel-pro'
cask 'tableplus'
cask 'hyper'
cask 'pock'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-firacode-nerd-font'
cask 'font-firacode-nerd-font-mono'

# Mac App Store
mas 'Sip', id: 507257563
mas 'Affinity Designer', id: 824171161
mas 'Affinity Photo', id: 824183456
mas 'Bear', id: 1016366447
mas 'iA Writer', id: 775737590
mas 'Contrast Color Accessibility', id: 1254981365
mas 'Keynote', id: 409183694
mas 'Page', id: 409201541
mas 'Numbers', id: 409203825
mas 'CotEditor', id: 1024640650
mas 'Amphetamine', id: 937984704
